tests/com/l7tech/service/resources/dotNetWseSignedRequest2.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><soap:Header><wsa:Action wsu:Id="Id-c52cff4b-6eb4-4ace-9b73-2327cb3c440a">http://warehouse.acme.com/ws/listProducts</wsa:Action><wsa:MessageID wsu:Id="Id-293d0915-8946-4a5e-bf15-cdfd539b1022">uuid:37bc4f4a-c58c-4fa1-a91d-2f27020d26f7</wsa:MessageID><wsa:ReplyTo wsu:Id="Id-30465b9a-590f-4594-8b72-71e4860c2fde"><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To wsu:Id="Id-46b8ebf0-cdfc-46a0-a0b5-ca81c5df7a15">http://ssgmike.l7tech.com:8080/ssg/soap</wsa:To><wsse:Security soap:mustUnderstand="1"><wsu:Timestamp wsu:Id="Timestamp-4d9baffa-e975-4ef9-aeaf-dfda9e0b7513"><wsu:Created>2004-08-12T20:00:05Z</wsu:Created><wsu:Expires>2004-08-12T20:05:05Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-c6b35331-1c27-4f46-9557-7797259d1d2a">MIICHDCCAYWgAwIBAgIIZlnZqDnDvH0wDQYJKoZIhvcNAQEFBQAwIjEgMB4GA1UEAxMXcm9vdC5zZXltb3VyLmw3dGVjaC5jb20wHhcNMDQwODA0MTk1NDEwWhcNMDYwODA0MTk1NDEwWjAdMRswGQYDVQQDExJzZXltb3VyLmw3dGVjaC5jb20wgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBAIskuwzrs+VsooY3VGI4GRB2R9G2ezEUMVd0MRjA5u9GbRkqFdff9YC7m6QiMH42zTrJHHlL2us198TyZcONWaaRg+v4AIQ18Z53tq6P+z20mEwCwZnb79lNWEmtsKmH+Yg5GG91ZmpitKnW/cuthFt5neIjQHpGtmWGQ54zxq/NAgMBAAGjYDBeMAwGA1UdEwEB/wQCMAAwDgYDVR0PAQH/BAQDAgWgMB0GA1UdDgQWBBT5r4+RJRc9Nds23Cv8z7QnruNHaDAfBgNVHSMEGDAWgBRGhDhss5lRl60UR7A5/gxG23CarjANBgkqhkiG9w0BAQUFAAOBgQBorecwMZgAIBKbRWFQnFCsAePF+J74X3v7N68hor1C+d/PV7FyJ9lZoWhUvfDehSI5y6TgG5snXfkiczrikJ0YEzjdY7pR/mBTaMaq84pp9SBGBlWaHp4O1REC+Ywe/+Rk++RQH/SH6pr9bgX9J+Vs4rrnJRu79l5TbaMdBSEaxA==</wsse:BinarySecurityToken><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" /><Reference URI="#Id-c52cff4b-6eb4-4ace-9b73-2327cb3c440a"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>/Y1rurCSM8pzuG0tFEwGQ8O4uX0=</DigestValue></Reference><Reference URI="#Id-293d0915-8946-4a5e-bf15-cdfd539b1022"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>z9cy9fIuwWCE8ui6lyK2Zq7smzA=</DigestValue></Reference><Reference URI="#Id-30465b9a-590f-4594-8b72-71e4860c2fde"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>qcuyZjsSMOkSZdpFd2p+FjpHhJA=</DigestValue></Reference><Reference URI="#Id-46b8ebf0-cdfc-46a0-a0b5-ca81c5df7a15"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>nZ10iCgrqRiLxGlLU5ZsEvROiEM=</DigestValue></Reference><Reference URI="#Timestamp-4d9baffa-e975-4ef9-aeaf-dfda9e0b7513"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>PsLOrHuQc0LjpfzD+vTLWv+iHwY=</DigestValue></Reference><Reference URI="#Id-3d7e9d79-0128-432c-9418-4ff26869d648"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>stcaak095TiL469wB+1csq9dOHo=</DigestValue></Reference></SignedInfo><SignatureValue>OlhI9f/zRbjhYvWAU+qWB0rRLT2VH3MmBnwNDdILN6u6MCalHQiUbRQOGKUFyvh1mK97bFOWkEV+pZe0IFzfn6hgLqIVnbZFh251IIKFT/5wk8ru1slJbJXc40co1+C4NvUthfqaNiKqknzQI+3qVycN+ly9aajx5x2XvFCGCF4=</SignatureValue><KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#SecurityToken-c6b35331-1c27-4f46-9557-7797259d1d2a" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" /></wsse:SecurityTokenReference></KeyInfo></Signature></wsse:Security></soap:Header><soap:Body wsu:Id="Id-3d7e9d79-0128-432c-9418-4ff26869d648"><listProducts xmlns="http://warehouse.acme.com/ws" /></soap:Body></soap:Envelope>